#include "../hal/hal.h"

void TIM2_IRQHandler(void) {
    if (TIM2_SR & TIM_SR_UIF) {
        TIM2_SR = 0;
        gpio_toggle(PIN_PC13);
    }
}

int main(void) {
    hal_init();
    gpio_init(PIN_PC13, OUTPUT);
    tim2_init_irq(500);  // мигаємо кожні 500мс

    while (1) {}
}

/* Button example по таймеру. Підключіть світлодіод до піна С13 катод (-) анод (+) до 3.3V.
   Коли таймер спрацьовує, він викликає переривання, в якому ми перемикаємо стан світлодіода.
   main перевіряє і робить інше, тому що ми не хочемо, щоб main висів в delay або чеканні.
   Це дозволяє нам робити інші речі в main, поки світлодіод мигає.

   Підключіть
  світлодіод до піна С13 катod (-) анod (+) до 3.3V.
*/